{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"keras_tensor_18": {"name": "keras_tensor_18:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "2"}, {"size": "4"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_9_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_10_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_10_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_6_1/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_7_1/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_18", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "2"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_9_1/Relu", "op": "_FusedConv2D", "input": ["keras_tensor_18", "StatefulPartitionedCall/functional_2_1/conv2d_9_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/conv2d_9_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_9_1/Relu", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_9_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/ExpandDims", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Reshape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/mul", "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat/values_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/strided_slice_2", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Tile", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Reshape_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/ExpandDims", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Reshape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/mul", "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat/values_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/strided_slice_2", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Tile", "StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_10_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_4_1/Repeat_1/Reshape_1", "StatefulPartitionedCall/functional_2_1/conv2d_10_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/conv2d_10_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_10_1/Relu", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_10_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/ExpandDims", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Reshape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/mul", "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat/values_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/strided_slice_2", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Tile", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Reshape_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/ExpandDims", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Shape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2/stack", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2/stack_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Reshape", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/mul", "ConstantFolding/StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat/values_1", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/strided_slice_2", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Tile", "StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/up_sampling2d_5_1/Repeat_1/Reshape_1", "StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/conv2d_11_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": 